//
//  EscapeResTimer.swift
//  EscapeGame2
//
//  Created by 維衣 on 2021/1/6.
//

import Foundation

struct EscapeResTimer {
    
    var escapeTimer = ""
    var timer = [String]()

    init(escapeTimer: String,timer:[String]){
        self.escapeTimer = escapeTimer
        self.timer = timer
    }
}

//    var timerArray = [EscapeResTimer(escapeTimer: "莎士比亞的邀請", timer: ["10:15", "11:45", "13:15", "14:45", "16:15", "17:45", "19:15", "20:45"]),
//                    EscapeResTimer(escapeTimer: "時鐘之國", timer: ["09:30", "11:00", "12:30", "13:30", "15:00", "16:30", "17:30", "19:00", "20:30"]),
//                    EscapeResTimer(escapeTimer: "鄉間小盜", timer: ["10:30", "11:30", "12:30", "13:30", "14:30", "15:30", "16:30", "17:30", "18:30", "19:30", "20:30"]),
//                    EscapeResTimer(escapeTimer: "禁錮之村", timer: ["11:00", "13:00", "15:00", "17:00", "19:00", "21:00"]),
//                    EscapeResTimer(escapeTimer: "流亡黯道", timer: ["11:00", "13:00", "15:00", "17:00", "19:00", "21:00"])]

    //https://www.appcoda.com.tw/higher-order-function/

//    class anyTimer: [String] {
//        var timer = [("10:15", "11:45", "13:15", "14:45", "16:15", "17:45", "19:15", "20:45"),
//                     ("09:30", "11:00", "12:30", "13:30", "15:00", "16:30", "17:30", "19:00", "20:30"),
//                     ("10:30", "11:30", "12:30", "13:30", "14:30", "15:30", "16:30", "17:30", "18:30", "19:30", "20:30"),
//                     (),(),()]
//    }

//    enum ResTimer: String {
//        case 莎士比亞的邀請: ["10:15", "11:45", "13:15", "14:45", "16:15", "17:45", "19:15", "20:45"]
//        case 時鐘之國: ["09:30", "11:00", "12:30", "13:30", "15:00", "16:30", "17:30", "19:00", "20:30"]
//        case 鄉間小盜: ["10:30", "11:30", "12:30", "13:30", "14:30", "15:30", "16:30", "17:30", "18:30", "19:30", "20:30"]
//        case 禁錮之村: ["11:00", "13:00", "15:00", "17:00", "19:00", "21:00"]
//        case 流亡黯道: ["11:00", "13:00", "15:00", "17:00", "19:00", "21:00"]
//    }


